Repository: payam-zahedi/payam-zahedi.github.io
Catalog: lib/l10n/intl_*.arb
Languages: fa

# title
source: Payam Zahedi Portfolio
fa: پورتفولیو پیام زاهدی

# profileDescription
source: I'm a Software Engineer fluent in Dart, Java, Kotlin languages, and Flutter, Android Frameworks. With more than 8 years of programming experience. I am very interested in learning in different fields, working on Open Source projects, speaking in technical events, and participating in programming communities. In addition, I am one of the founders and speakers of the Persian Flutter Community.
fa: لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.

# name
source: Payam
fa: پیام

# family
source: Zahedi
fa: زاهدی

# socialTitle
source: Find me in Socials
fa: من رو در شبکه های اجتماعی پیدا کنید

source: Software Developer
fa: توسعه دهنده نرم افزار

# cvButton
source: Download CV
fa: دانلود رزومه

# softwareDeveloperDescription
source: I'm a software developer who enjoys building new things, learning and challenges. I specialize in mobile software development. But I'm also interested in other areas of software engineering. I use Flutter to develop multi-platform software and use native Kotlin to produce native Android software.
fa: من یک توسعه دهنده نرم افزار هستم که از ساختن چیزهای جدید ، یادگیری و چالش ها لذت می برم. من در زمینه تولید نرم افزار موبایل تخصص دارم. علاوه بر موبایل به سایر زمینه های مهندسی نرم افزار نیز علاقه مند هستم. برای توسعه نرم افزارهای Multi-Platform از فریم ورک Flutter و از Kotlin برای تولید نرم افزارهای اندروید استفاده می کنم.

source: Open Source
fa: متن باز

# openSourceDescription
source: I learned everything from open source. So I decided to be part of this community. I use my free time to participate in open source and developers community. Even this Portfolio web site is Open source, you can check the source code of it in my Github Account.
fa: من همه چیز را از پروژه ها و آموزش های Open Source آموختم. بنابراین تصمیم گرفتم که بخشی از این جامعه باشم. از وقت آزادم برای شرکت در Open Source و جوامع توسعه دهندگان استفاده می کنم. حتی این وب سایت هم به صورت متن باز ارائه شده است، می توانید کد آن را در حساب Github من بررسی کنید.

# speaker
source: Speaker & Organizer
fa: سخنران و برنامه ریز

# speakerDescription
source: I love sharing my knowledge with the community by writing, speaking and organizing Meetups and events. I am also one of the funders & organizers of Persian Flutter Community. You can find our events at PersianFlutter.com.
fa: من برای به اشتراک گذاشتن دانش خود با جامعه از طریق نوشتن ، ارائه دادن ، سازماندهی رویدادها بسیار مشتاقم. همچنین یکی از بنیانگذاران و سازمان دهندگان جامعه فلاتر فارسی هستم. می توانید رویدادهای ما را در PersianFlutter.com بیابید.

source: Design Tools
fa: ابزارهای طراحی

# designToolsDescription
source: I'm curious about product design methods and tools and passionate to read about them. I also have the ability to use tools like Adobe XD and Figma.
fa: در مورد روش ها و ابزارهای طراحی محصول کنجکاوم و دوست دارم درمورد آنها مطالعه کنم. من همچنین توانایی استفاده از ابزارهایی مانند Adobe XD و Figma را دارم.
